experiments/flaw1/6-9-2026-keda-cpu-scaler/experiment_run_2/vegeta.1.log
Requests      [total, rate, throughput]         12, 10.91, 10.71
Duration      [total, attack, wait]             1.121s, 1.099s, 21.507ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.206ms, 21.583ms, 21.513ms, 22.019ms, 22.339ms, 22.393ms, 22.393ms
Bytes In      [total, mean]                     24, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:12  
Error Set:
Requests      [total, rate, throughput]         22, 10.48, 10.37
Duration      [total, attack, wait]             2.121s, 2.1s, 21.372ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.206ms, 21.484ms, 21.433ms, 21.727ms, 22.072ms, 22.393ms, 22.393ms
Bytes In      [total, mean]                     44, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:22  
Error Set:
Requests      [total, rate, throughput]         32, 10.32, 10.25
Duration      [total, attack, wait]             3.121s, 3.1s, 21.219ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.15ms, 21.426ms, 21.369ms, 21.599ms, 21.84ms, 22.393ms, 22.393ms
Bytes In      [total, mean]                     64, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:32  
Error Set:
Requests      [total, rate, throughput]         42, 10.24, 10.19
Duration      [total, attack, wait]             4.121s, 4.1s, 21.261ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.407ms, 21.363ms, 21.592ms, 21.746ms, 22.393ms, 22.393ms
Bytes In      [total, mean]                     84, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:42  
Error Set:
Requests      [total, rate, throughput]         52, 10.20, 10.15
Duration      [total, attack, wait]             5.121s, 5.1s, 21.407ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.387ms, 21.353ms, 21.548ms, 21.669ms, 22.382ms, 22.393ms
Bytes In      [total, mean]                     104, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:52  
Error Set:
Requests      [total, rate, throughput]         62, 10.16, 10.13
Duration      [total, attack, wait]             6.122s, 6.1s, 21.467ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.374ms, 21.341ms, 21.525ms, 21.657ms, 22.329ms, 22.393ms
Bytes In      [total, mean]                     124, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:62  
Error Set:
Requests      [total, rate, throughput]         72, 10.14, 10.11
Duration      [total, attack, wait]             7.121s, 7.1s, 21.251ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.364ms, 21.335ms, 21.518ms, 21.64ms, 22.275ms, 22.393ms
Bytes In      [total, mean]                     144, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:72  
Error Set:
Requests      [total, rate, throughput]         82, 10.12, 10.10
Duration      [total, attack, wait]             8.121s, 8.099s, 21.201ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.362ms, 21.337ms, 21.514ms, 21.6ms, 22.222ms, 22.393ms
Bytes In      [total, mean]                     164, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:82  
Error Set:
Requests      [total, rate, throughput]         92, 10.11, 10.09
Duration      [total, attack, wait]             9.121s, 9.1s, 21.222ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.359ms, 21.337ms, 21.508ms, 21.566ms, 22.168ms, 22.393ms
Bytes In      [total, mean]                     184, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:92  
Error Set:
Requests      [total, rate, throughput]         102, 10.10, 10.08
Duration      [total, attack, wait]             10.121s, 10.1s, 21.321ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.359ms, 21.338ms, 21.496ms, 21.551ms, 22.115ms, 22.393ms
Bytes In      [total, mean]                     204, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:102  
Error Set:
Requests      [total, rate, throughput]         112, 10.09, 10.07
Duration      [total, attack, wait]             11.121s, 11.1s, 21.329ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.356ms, 21.337ms, 21.489ms, 21.538ms, 22.062ms, 22.393ms
Bytes In      [total, mean]                     224, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:112  
Error Set:
Requests      [total, rate, throughput]         122, 10.08, 10.06
Duration      [total, attack, wait]             12.122s, 12.1s, 21.44ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.38ms, 21.346ms, 21.508ms, 21.563ms, 22.751ms, 23.672ms
Bytes In      [total, mean]                     244, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:122  
Error Set:
Requests      [total, rate, throughput]         132, 10.08, 10.06
Duration      [total, attack, wait]             13.121s, 13.099s, 21.42ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.376ms, 21.347ms, 21.508ms, 21.559ms, 22.623ms, 23.672ms
Bytes In      [total, mean]                     264, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:132  
Error Set:
Requests      [total, rate, throughput]         142, 10.07, 10.06
Duration      [total, attack, wait]             14.122s, 14.1s, 21.319ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.376ms, 21.346ms, 21.508ms, 21.557ms, 22.495ms, 23.672ms
Bytes In      [total, mean]                     284, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:142  
Error Set:
Requests      [total, rate, throughput]         152, 10.07, 10.05
Duration      [total, attack, wait]             15.121s, 15.1s, 21.243ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.377ms, 21.348ms, 21.499ms, 21.554ms, 22.382ms, 23.672ms
Bytes In      [total, mean]                     304, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:152  
Error Set:
Requests      [total, rate, throughput]         162, 10.06, 10.05
Duration      [total, attack, wait]             16.121s, 16.1s, 21.26ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.378ms, 21.349ms, 21.508ms, 21.557ms, 22.329ms, 23.672ms
Bytes In      [total, mean]                     324, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:162  
Error Set:
Requests      [total, rate, throughput]         172, 10.06, 10.05
Duration      [total, attack, wait]             17.121s, 17.1s, 21.386ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.374ms, 21.347ms, 21.502ms, 21.554ms, 22.275ms, 23.672ms
Bytes In      [total, mean]                     344, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:172  
Error Set:
Requests      [total, rate, throughput]         182, 10.06, 10.04
Duration      [total, attack, wait]             18.121s, 18.1s, 21.448ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.37ms, 21.346ms, 21.497ms, 21.546ms, 22.222ms, 23.672ms
Bytes In      [total, mean]                     364, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:182  
Error Set:
Requests      [total, rate, throughput]         192, 10.05, 10.04
Duration      [total, attack, wait]             19.121s, 19.1s, 21.196ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.37ms, 21.348ms, 21.494ms, 21.539ms, 22.168ms, 23.672ms
Bytes In      [total, mean]                     384, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:192  
Error Set:
Requests      [total, rate, throughput]         202, 10.05, 10.04
Duration      [total, attack, wait]             20.122s, 20.1s, 21.302ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.369ms, 21.348ms, 21.492ms, 21.539ms, 22.115ms, 23.672ms
Bytes In      [total, mean]                     404, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:202  
Error Set:
Requests      [total, rate, throughput]         212, 10.05, 10.04
Duration      [total, attack, wait]             21.121s, 21.1s, 21.322ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.107ms, 21.367ms, 21.346ms, 21.492ms, 21.539ms, 22.062ms, 23.672ms
Bytes In      [total, mean]                     424, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:212  
Error Set:
Requests      [total, rate, throughput]         222, 10.05, 10.04
Duration      [total, attack, wait]             22.121s, 22.1s, 21.148ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.362ms, 21.338ms, 21.491ms, 21.539ms, 22.008ms, 23.672ms
Bytes In      [total, mean]                     444, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:222  
Error Set:
Requests      [total, rate, throughput]         232, 10.04, 10.03
Duration      [total, attack, wait]             23.121s, 23.1s, 21.346ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.36ms, 21.335ms, 21.489ms, 21.537ms, 21.955ms, 23.672ms
Bytes In      [total, mean]                     464, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:232  
Error Set:
Requests      [total, rate, throughput]         242, 10.04, 10.03
Duration      [total, attack, wait]             24.121s, 24.1s, 21.269ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.356ms, 21.328ms, 21.488ms, 21.531ms, 21.901ms, 23.672ms
Bytes In      [total, mean]                     484, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:242  
Error Set:
Requests      [total, rate, throughput]         252, 10.04, 10.03
Duration      [total, attack, wait]             25.121s, 25.1s, 21.249ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.353ms, 21.327ms, 21.487ms, 21.526ms, 21.855ms, 23.672ms
Bytes In      [total, mean]                     504, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:252  
Error Set:
Requests      [total, rate, throughput]         262, 10.04, 10.03
Duration      [total, attack, wait]             26.121s, 26.1s, 21.22ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.351ms, 21.327ms, 21.487ms, 21.522ms, 21.836ms, 23.672ms
Bytes In      [total, mean]                     524, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:262  
Error Set:
Requests      [total, rate, throughput]         272, 10.04, 10.03
Duration      [total, attack, wait]             27.121s, 27.099s, 21.321ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.349ms, 21.326ms, 21.484ms, 21.519ms, 21.817ms, 23.672ms
Bytes In      [total, mean]                     544, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:272  
Error Set:
Requests      [total, rate, throughput]         282, 10.04, 10.03
Duration      [total, attack, wait]             28.121s, 28.1s, 21.185ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.346ms, 21.324ms, 21.48ms, 21.518ms, 21.799ms, 23.672ms
Bytes In      [total, mean]                     564, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:282  
Error Set:
Requests      [total, rate, throughput]         292, 10.03, 10.03
Duration      [total, attack, wait]             29.121s, 29.1s, 21.403ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.348ms, 21.325ms, 21.487ms, 21.519ms, 21.998ms, 23.672ms
Bytes In      [total, mean]                     584, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:292  
Error Set:
Requests      [total, rate, throughput]         302, 10.03, 10.03
Duration      [total, attack, wait]             30.121s, 30.1s, 21.412ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.349ms, 21.325ms, 21.484ms, 21.518ms, 21.974ms, 23.672ms
Bytes In      [total, mean]                     604, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:302  
Error Set:
Requests      [total, rate, throughput]         312, 10.03, 10.03
Duration      [total, attack, wait]             31.121s, 31.1s, 21.205ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.347ms, 21.325ms, 21.48ms, 21.518ms, 21.95ms, 23.672ms
Bytes In      [total, mean]                     624, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:312  
Error Set:
Requests      [total, rate, throughput]         322, 10.03, 10.02
Duration      [total, attack, wait]             32.121s, 32.1s, 21.308ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.346ms, 21.325ms, 21.48ms, 21.516ms, 21.926ms, 23.672ms
Bytes In      [total, mean]                     644, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:322  
Error Set:
Requests      [total, rate, throughput]         332, 10.03, 10.02
Duration      [total, attack, wait]             33.121s, 33.1s, 21.318ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.345ms, 21.324ms, 21.48ms, 21.515ms, 21.902ms, 23.672ms
Bytes In      [total, mean]                     664, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:332  
Error Set:
Requests      [total, rate, throughput]         342, 10.03, 10.02
Duration      [total, attack, wait]             34.121s, 34.1s, 21.375ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.345ms, 21.324ms, 21.48ms, 21.513ms, 21.878ms, 23.672ms
Bytes In      [total, mean]                     684, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:342  
Error Set:
Requests      [total, rate, throughput]         352, 10.03, 10.02
Duration      [total, attack, wait]             35.121s, 35.1s, 21.214ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.342ms, 21.323ms, 21.477ms, 21.512ms, 21.855ms, 23.672ms
Bytes In      [total, mean]                     704, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:352  
Error Set:
Requests      [total, rate, throughput]         362, 10.03, 10.02
Duration      [total, attack, wait]             36.121s, 36.1s, 21.316ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.34ms, 21.322ms, 21.475ms, 21.51ms, 21.836ms, 23.672ms
Bytes In      [total, mean]                     724, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:362  
Error Set:
Requests      [total, rate, throughput]         372, 10.03, 10.02
Duration      [total, attack, wait]             37.122s, 37.1s, 21.339ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.338ms, 21.321ms, 21.473ms, 21.508ms, 21.817ms, 23.672ms
Bytes In      [total, mean]                     744, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:372  
Error Set:
Requests      [total, rate, throughput]         382, 10.03, 10.02
Duration      [total, attack, wait]             38.121s, 38.1s, 21.217ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.336ms, 21.319ms, 21.472ms, 21.507ms, 21.799ms, 23.672ms
Bytes In      [total, mean]                     764, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:382  
Error Set:
Requests      [total, rate, throughput]         392, 10.03, 10.02
Duration      [total, attack, wait]             39.121s, 39.1s, 21.426ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.334ms, 21.318ms, 21.47ms, 21.505ms, 21.78ms, 23.672ms
Bytes In      [total, mean]                     784, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:392  
Error Set:
Requests      [total, rate, throughput]         402, 10.02, 10.02
Duration      [total, attack, wait]             40.121s, 40.1s, 21.165ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.1ms, 21.332ms, 21.317ms, 21.469ms, 21.503ms, 21.761ms, 23.672ms
Bytes In      [total, mean]                     804, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:402  
Error Set:
Requests      [total, rate, throughput]         412, 10.02, 10.02
Duration      [total, attack, wait]             41.121s, 41.099s, 21.303ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.331ms, 21.316ms, 21.468ms, 21.501ms, 21.742ms, 23.672ms
Bytes In      [total, mean]                     824, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:412  
Error Set:
Requests      [total, rate, throughput]         422, 10.02, 10.02
Duration      [total, attack, wait]             42.121s, 42.1s, 21.217ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.329ms, 21.316ms, 21.466ms, 21.5ms, 21.724ms, 23.672ms
Bytes In      [total, mean]                     844, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:422  
Error Set:
Requests      [total, rate, throughput]         432, 10.02, 10.02
Duration      [total, attack, wait]             43.121s, 43.099s, 21.467ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.328ms, 21.315ms, 21.466ms, 21.499ms, 21.705ms, 23.672ms
Bytes In      [total, mean]                     864, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:432  
Error Set:
Requests      [total, rate, throughput]         442, 10.02, 10.02
Duration      [total, attack, wait]             44.121s, 44.1s, 21.207ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.326ms, 21.314ms, 21.464ms, 21.497ms, 21.686ms, 23.672ms
Bytes In      [total, mean]                     884, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:442  
Error Set:
Requests      [total, rate, throughput]         452, 10.02, 10.02
Duration      [total, attack, wait]             45.121s, 45.1s, 21.409ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.326ms, 21.314ms, 21.463ms, 21.496ms, 21.671ms, 23.672ms
Bytes In      [total, mean]                     904, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:452  
Error Set:
Requests      [total, rate, throughput]         462, 10.02, 10.02
Duration      [total, attack, wait]             46.121s, 46.1s, 21.232ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.327ms, 21.313ms, 21.463ms, 21.497ms, 21.836ms, 23.672ms
Bytes In      [total, mean]                     924, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:462  
Error Set:
Requests      [total, rate, throughput]         472, 10.02, 10.02
Duration      [total, attack, wait]             47.122s, 47.1s, 21.268ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.325ms, 21.311ms, 21.461ms, 21.496ms, 21.817ms, 23.672ms
Bytes In      [total, mean]                     944, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:472  
Error Set:
Requests      [total, rate, throughput]         482, 10.02, 10.02
Duration      [total, attack, wait]             48.121s, 48.1s, 21.298ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.324ms, 21.311ms, 21.459ms, 21.495ms, 21.799ms, 23.672ms
Bytes In      [total, mean]                     964, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:482  
Error Set:
Requests      [total, rate, throughput]         492, 10.02, 10.02
Duration      [total, attack, wait]             49.121s, 49.1s, 21.257ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.324ms, 21.311ms, 21.457ms, 21.495ms, 21.78ms, 23.672ms
Bytes In      [total, mean]                     984, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:492  
Error Set:
Requests      [total, rate, throughput]         502, 10.02, 10.02
Duration      [total, attack, wait]             50.121s, 50.1s, 21.188ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.323ms, 21.311ms, 21.454ms, 21.494ms, 21.761ms, 23.672ms
Bytes In      [total, mean]                     1004, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:502  
Error Set:
Requests      [total, rate, throughput]         512, 10.02, 10.02
Duration      [total, attack, wait]             51.121s, 51.1s, 21.303ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.323ms, 21.31ms, 21.452ms, 21.493ms, 21.742ms, 23.672ms
Bytes In      [total, mean]                     1024, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:512  
Error Set:
Requests      [total, rate, throughput]         522, 10.02, 10.02
Duration      [total, attack, wait]             52.121s, 52.1s, 21.352ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.322ms, 21.31ms, 21.448ms, 21.492ms, 21.724ms, 23.672ms
Bytes In      [total, mean]                     1044, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:522  
Error Set:
Requests      [total, rate, throughput]         532, 10.02, 10.01
Duration      [total, attack, wait]             53.121s, 53.099s, 21.221ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.321ms, 21.309ms, 21.445ms, 21.492ms, 21.705ms, 23.672ms
Bytes In      [total, mean]                     1064, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:532  
Error Set:
Requests      [total, rate, throughput]         542, 10.02, 10.01
Duration      [total, attack, wait]             54.121s, 54.1s, 21.184ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.32ms, 21.308ms, 21.441ms, 21.491ms, 21.686ms, 23.672ms
Bytes In      [total, mean]                     1084, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:542  
Error Set:
Requests      [total, rate, throughput]         552, 10.02, 10.01
Duration      [total, attack, wait]             55.121s, 55.1s, 21.139ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.319ms, 21.308ms, 21.44ms, 21.49ms, 21.671ms, 23.672ms
Bytes In      [total, mean]                     1104, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:552  
Error Set:
Requests      [total, rate, throughput]         562, 10.02, 10.01
Duration      [total, attack, wait]             56.122s, 56.1s, 21.199ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.318ms, 21.308ms, 21.439ms, 21.489ms, 21.668ms, 23.672ms
Bytes In      [total, mean]                     1124, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:562  
Error Set:
Requests      [total, rate, throughput]         572, 10.02, 10.01
Duration      [total, attack, wait]             57.121s, 57.1s, 21.239ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.318ms, 21.307ms, 21.439ms, 21.489ms, 21.666ms, 23.672ms
Bytes In      [total, mean]                     1144, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:572  
Error Set:
Requests      [total, rate, throughput]         582, 10.02, 10.01
Duration      [total, attack, wait]             58.121s, 58.1s, 21.329ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.317ms, 21.306ms, 21.438ms, 21.488ms, 21.664ms, 23.672ms
Bytes In      [total, mean]                     1164, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:582  
Error Set:
Requests      [total, rate, throughput]         592, 10.02, 10.01
Duration      [total, attack, wait]             59.121s, 59.1s, 21.334ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.316ms, 21.305ms, 21.436ms, 21.488ms, 21.654ms, 23.672ms
Bytes In      [total, mean]                     1184, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:592  
Error Set:
Requests      [total, rate, throughput]         600, 10.02, 10.01
Duration      [total, attack, wait]             59.922s, 59.9s, 21.366ms
Latencies     [min, mean, 50, 90, 95, 99, max]  21.021ms, 21.315ms, 21.305ms, 21.435ms, 21.487ms, 21.65ms, 23.672ms
Bytes In      [total, mean]                     1200, 2.00
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:600  
Error Set: